zeha/xc32/pic32c-source/XC32-arm-gcc/gcc/gcc/testsuite/gcc.target/pic32c/xc32-shell/test-dfp-32CZ_CA70/edc/PIC32CZ2038CA70144.PIC
      <edc:AdjustPoint edc:_addr="0x4001C0D4" edc:offset="0x10"/>
      <edc:SFRDef edc:_addr="0x4001C0E4" edc:access="nnnnnnnnnnnnnnnnnnnnnnnn-------n" edc:cname="TWI1_WPMR" edc:nzwidth="0x20" ltx:memberofperipheral="TWI1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="WPEN" edc:desc="Write Protection Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="WPKEY" edc:desc="Write Protection Key" edc:nzwidth="0x18">
              <edc:SFRFieldSemantic edc:cname="PASSWD" edc:desc="Writing any other value in this field aborts the write operation of the WPEN bit.Always reads as 0" edc:when="(field &amp; 0xFFFFFF) == 0x545749"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4001C0E8" edc:access="rrrrrrrrrrrrrrrrrrrrrrrr-------r" edc:cname="TWI1_WPSR" edc:nzwidth="0x20" ltx:memberofperipheral="TWI1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="WPVS" edc:desc="Write Protection Violation Status" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="WPVSRC" edc:desc="Write Protection Violation Source" edc:nzwidth="0x18"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x4001C0EC" edc:offset="0x3F14"/>
      <edc:SFRDef edc:_addr="0x40020000" edc:access="----nnnnnnnnnnnn----nnnnnnnnnnnn" edc:cname="PWMC0_CLK" edc:nzwidth="0x20" ltx:memberofperipheral="PWMC0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="DIVA" edc:desc="CLKA Divide Factor" edc:nzwidth="0x8">
              <edc:SFRFieldSemantic edc:cname="CLKA_POFF" edc:desc="CLKA clock is turned off" edc:when="(field &amp; 0xFF) == 0"/>
              <edc:SFRFieldSemantic edc:cname="PREA" edc:desc="CLKA clock is clock selected by PREA" edc:when="(field &amp; 0xFF) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="PREA" edc:desc="CLKA Source Clock Selection" edc:nzwidth="0x4">
              <edc:SFRFieldSemantic edc:cname="CLK" edc:desc="Peripheral clock" edc:when="(field &amp; 0xF) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="CLK_DIV2" edc:desc="Peripheral clock/2" edc:when="(field &amp; 0xF) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="CLK_DIV4" edc:desc="Peripheral clock/4" edc:when="(field &amp; 0xF) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="CLK_DIV8" edc:desc="Peripheral clock/8" edc:when="(field &amp; 0xF) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="CLK_DIV16" edc:desc="Peripheral clock/16" edc:when="(field &amp; 0xF) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="CLK_DIV32" edc:desc="Peripheral clock/32" edc:when="(field &amp; 0xF) == 0x5"/>
              <edc:SFRFieldSemantic edc:cname="CLK_DIV64" edc:desc="Peripheral clock/64" edc:when="(field &amp; 0xF) == 0x6"/>
              <edc:SFRFieldSemantic edc:cname="CLK_DIV128" edc:desc="Peripheral clock/128" edc:when="(field &amp; 0xF) == 0x7"/>
              <edc:SFRFieldSemantic edc:cname="CLK_DIV256" edc:desc="Peripheral clock/256" edc:when="(field &amp; 0xF) == 0x8"/>
              <edc:SFRFieldSemantic edc:cname="CLK_DIV512" edc:desc="Peripheral clock/512" edc:when="(field &amp; 0xF) == 0x9"/>
              <edc:SFRFieldSemantic edc:cname="CLK_DIV1024" edc:desc="Peripheral clock/1024" edc:when="(field &amp; 0xF) == 0xA"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="DIVB" edc:desc="CLKB Divide Factor" edc:nzwidth="0x8">
              <edc:SFRFieldSemantic edc:cname="CLKB_POFF" edc:desc="CLKB clock is turned off" edc:when="(field &amp; 0xFF) == 0"/>
              <edc:SFRFieldSemantic edc:cname="PREB" edc:desc="CLKB clock is clock selected by PREB" edc:when="(field &amp; 0xFF) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="PREB" edc:desc="CLKB Source Clock Selection" edc:nzwidth="0x4">
              <edc:SFRFieldSemantic edc:cname="CLK" edc:desc="Peripheral clock" edc:when="(field &amp; 0xF) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="CLK_DIV2" edc:desc="Peripheral clock/2" edc:when="(field &amp; 0xF) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="CLK_DIV4" edc:desc="Peripheral clock/4" edc:when="(field &amp; 0xF) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="CLK_DIV8" edc:desc="Peripheral clock/8" edc:when="(field &amp; 0xF) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="CLK_DIV16" edc:desc="Peripheral clock/16" edc:when="(field &amp; 0xF) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="CLK_DIV32" edc:desc="Peripheral clock/32" edc:when="(field &amp; 0xF) == 0x5"/>
              <edc:SFRFieldSemantic edc:cname="CLK_DIV64" edc:desc="Peripheral clock/64" edc:when="(field &amp; 0xF) == 0x6"/>
              <edc:SFRFieldSemantic edc:cname="CLK_DIV128" edc:desc="Peripheral clock/128" edc:when="(field &amp; 0xF) == 0x7"/>
              <edc:SFRFieldSemantic edc:cname="CLK_DIV256" edc:desc="Peripheral clock/256" edc:when="(field &amp; 0xF) == 0x8"/>
              <edc:SFRFieldSemantic edc:cname="CLK_DIV512" edc:desc="Peripheral clock/512" edc:when="(field &amp; 0xF) == 0x9"/>
              <edc:SFRFieldSemantic edc:cname="CLK_DIV1024" edc:desc="Peripheral clock/1024" edc:when="(field &amp; 0xF) == 0xA"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40020004" edc:access="----------------------------wwww" edc:cname="PWMC0_ENA" edc:nzwidth="0x20" ltx:memberofperipheral="PWMC0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CHID0" edc:desc="Channel ID" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHID1" edc:desc="Channel ID" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHID2" edc:desc="Channel ID" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHID3" edc:desc="Channel ID" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40020008" edc:access="----------------------------wwww" edc:cname="PWMC0_DIS" edc:nzwidth="0x20" ltx:memberofperipheral="PWMC0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CHID0" edc:desc="Channel ID" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHID1" edc:desc="Channel ID" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHID2" edc:desc="Channel ID" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHID3" edc:desc="Channel ID" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4002000C" edc:access="----------------------------rrrr" edc:cname="PWMC0_SR" edc:nzwidth="0x20" ltx:memberofperipheral="PWMC0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CHID0" edc:desc="Channel ID" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHID1" edc:desc="Channel ID" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHID2" edc:desc="Channel ID" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHID3" edc:desc="Channel ID" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40020010" edc:access="------------wwww------------wwww" edc:cname="PWMC0_IER1" edc:nzwidth="0x20" ltx:memberofperipheral="PWMC0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CHID0" edc:desc="Counter Event on Channel 0 Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHID1" edc:desc="Counter Event on Channel 1 Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHID2" edc:desc="Counter Event on Channel 2 Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHID3" edc:desc="Counter Event on Channel 3 Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0xC"/>
            <edc:SFRFieldDef edc:cname="FCHID0" edc:desc="Fault Protection Trigger on Channel 0 Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FCHID1" edc:desc="Fault Protection Trigger on Channel 1 Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FCHID2" edc:desc="Fault Protection Trigger on Channel 2 Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FCHID3" edc:desc="Fault Protection Trigger on Channel 3 Interrupt Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40020014" edc:access="------------wwww------------wwww" edc:cname="PWMC0_IDR1" edc:nzwidth="0x20" ltx:memberofperipheral="PWMC0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CHID0" edc:desc="Counter Event on Channel 0 Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHID1" edc:desc="Counter Event on Channel 1 Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHID2" edc:desc="Counter Event on Channel 2 Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHID3" edc:desc="Counter Event on Channel 3 Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0xC"/>
            <edc:SFRFieldDef edc:cname="FCHID0" edc:desc="Fault Protection Trigger on Channel 0 Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FCHID1" edc:desc="Fault Protection Trigger on Channel 1 Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FCHID2" edc:desc="Fault Protection Trigger on Channel 2 Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FCHID3" edc:desc="Fault Protection Trigger on Channel 3 Interrupt Disable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40020018" edc:access="------------rrrr------------rrrr" edc:cname="PWMC0_IMR1" edc:nzwidth="0x20" ltx:memberofperipheral="PWMC0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CHID0" edc:desc="Counter Event on Channel 0 Interrupt Mask" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHID1" edc:desc="Counter Event on Channel 1 Interrupt Mask" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHID2" edc:desc="Counter Event on Channel 2 Interrupt Mask" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHID3" edc:desc="Counter Event on Channel 3 Interrupt Mask" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0xC"/>
            <edc:SFRFieldDef edc:cname="FCHID0" edc:desc="Fault Protection Trigger on Channel 0 Interrupt Mask" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FCHID1" edc:desc="Fault Protection Trigger on Channel 1 Interrupt Mask" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FCHID2" edc:desc="Fault Protection Trigger on Channel 2 Interrupt Mask" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FCHID3" edc:desc="Fault Protection Trigger on Channel 3 Interrupt Mask" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4002001C" edc:access="------------rrrr------------rrrr" edc:cname="PWMC0_ISR1" edc:nzwidth="0x20" ltx:memberofperipheral="PWMC0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CHID0" edc:desc="Counter Event on Channel 0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHID1" edc:desc="Counter Event on Channel 1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHID2" edc:desc="Counter Event on Channel 2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHID3" edc:desc="Counter Event on Channel 3" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0xC"/>
            <edc:SFRFieldDef edc:cname="FCHID0" edc:desc="Fault Protection Trigger on Channel 0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FCHID1" edc:desc="Fault Protection Trigger on Channel 1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FCHID2" edc:desc="Fault Protection Trigger on Channel 2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FCHID3" edc:desc="Fault Protection Trigger on Channel 3" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40020020" edc:access="--------nnnn--nn------------nnnn" edc:cname="PWMC0_SCM" edc:nzwidth="0x20" ltx:memberofperipheral="PWMC0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="SYNC0" edc:desc="Synchronous Channel 0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SYNC1" edc:desc="Synchronous Channel 1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SYNC2" edc:desc="Synchronous Channel 2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SYNC3" edc:desc="Synchronous Channel 3" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0xC"/>
            <edc:SFRFieldDef edc:cname="UPDM" edc:desc="Synchronous Channels Update Mode" edc:nzwidth="0x2"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="PTRM" edc:desc="DMA Controller Transfer Request Mode" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PTRCS" edc:desc="DMA Controller Transfer Request Comparison Selection" edc:nzwidth="0x3"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40020024" edc:access="--------wwwwwwwwwwwwwwwwwwwwwwww" edc:cname="PWMC0_DMAR" edc:nzwidth="0x20" ltx:memberofperipheral="PWMC0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="DMADUTY" edc:desc="Duty-Cycle Holding Register for DMA Access" edc:nzwidth="0x18"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40020028" edc:access="-------------------------------n" edc:cname="PWMC0_SCUC" edc:nzwidth="0x20" ltx:memberofperipheral="PWMC0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="UPDULOCK" edc:desc="Synchronous Channels Update Unlock" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4002002C" edc:access="------------------------nnnnnnnn" edc:cname="PWMC0_SCUP" edc:nzwidth="0x20" ltx:memberofperipheral="PWMC0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="UPR" edc:desc="Update Period" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="UPRCNT" edc:desc="Update Period Counter" edc:nzwidth="0x4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40020030" edc:access="----------------------------wwww" edc:cname="PWMC0_SCUPUPD" edc:nzwidth="0x20" ltx:memberofperipheral="PWMC0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="UPRUPD" edc:desc="Update Period Update" edc:nzwidth="0x4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40020034" edc:access="--------wwwwwwwwwwwwwwww----w--w" edc:cname="PWMC0_IER2" edc:nzwidth="0x20" ltx:memberofperipheral="PWMC0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="WRDY" edc:desc="Write Ready for Synchronous Channels Update Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="UNRE" edc:desc="Synchronous Channels Update Underrun Error Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="CMPM0" edc:desc="Comparison 0 Match Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPM1" edc:desc="Comparison 1 Match Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPM2" edc:desc="Comparison 2 Match Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPM3" edc:desc="Comparison 3 Match Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPM4" edc:desc="Comparison 4 Match Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPM5" edc:desc="Comparison 5 Match Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPM6" edc:desc="Comparison 6 Match Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPM7" edc:desc="Comparison 7 Match Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPU0" edc:desc="Comparison 0 Update Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPU1" edc:desc="Comparison 1 Update Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPU2" edc:desc="Comparison 2 Update Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPU3" edc:desc="Comparison 3 Update Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPU4" edc:desc="Comparison 4 Update Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPU5" edc:desc="Comparison 5 Update Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPU6" edc:desc="Comparison 6 Update Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPU7" edc:desc="Comparison 7 Update Interrupt Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
