zeha/xc32/pic32c-source/XC32-arm-gcc/gcc/gcc/testsuite/gcc.target/pic32c/xc32-shell/test-dfp-32CZ_CA70/edc/PIC32CZ2038CA70144.PIC
      <edc:SFRDef edc:_addr="0x4002004C" edc:access="------------wwww------------wwww" edc:cname="PWMC0_OSS" edc:nzwidth="0x20" ltx:memberofperipheral="PWMC0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="OSSH0" edc:desc="Output Selection Set for PWMH output of the channel 0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OSSH1" edc:desc="Output Selection Set for PWMH output of the channel 1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OSSH2" edc:desc="Output Selection Set for PWMH output of the channel 2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OSSH3" edc:desc="Output Selection Set for PWMH output of the channel 3" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0xC"/>
            <edc:SFRFieldDef edc:cname="OSSL0" edc:desc="Output Selection Set for PWML output of the channel 0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OSSL1" edc:desc="Output Selection Set for PWML output of the channel 1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OSSL2" edc:desc="Output Selection Set for PWML output of the channel 2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OSSL3" edc:desc="Output Selection Set for PWML output of the channel 3" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40020050" edc:access="------------wwww------------wwww" edc:cname="PWMC0_OSC" edc:nzwidth="0x20" ltx:memberofperipheral="PWMC0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="OSCH0" edc:desc="Output Selection Clear for PWMH output of the channel 0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OSCH1" edc:desc="Output Selection Clear for PWMH output of the channel 1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OSCH2" edc:desc="Output Selection Clear for PWMH output of the channel 2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OSCH3" edc:desc="Output Selection Clear for PWMH output of the channel 3" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0xC"/>
            <edc:SFRFieldDef edc:cname="OSCL0" edc:desc="Output Selection Clear for PWML output of the channel 0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OSCL1" edc:desc="Output Selection Clear for PWML output of the channel 1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OSCL2" edc:desc="Output Selection Clear for PWML output of the channel 2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OSCL3" edc:desc="Output Selection Clear for PWML output of the channel 3" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40020054" edc:access="------------wwww------------wwww" edc:cname="PWMC0_OSSUPD" edc:nzwidth="0x20" ltx:memberofperipheral="PWMC0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="OSSUPH0" edc:desc="Output Selection Set for PWMH output of the channel 0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OSSUPH1" edc:desc="Output Selection Set for PWMH output of the channel 1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OSSUPH2" edc:desc="Output Selection Set for PWMH output of the channel 2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OSSUPH3" edc:desc="Output Selection Set for PWMH output of the channel 3" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0xC"/>
            <edc:SFRFieldDef edc:cname="OSSUPL0" edc:desc="Output Selection Set for PWML output of the channel 0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OSSUPL1" edc:desc="Output Selection Set for PWML output of the channel 1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OSSUPL2" edc:desc="Output Selection Set for PWML output of the channel 2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OSSUPL3" edc:desc="Output Selection Set for PWML output of the channel 3" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40020058" edc:access="------------wwww------------wwww" edc:cname="PWMC0_OSCUPD" edc:nzwidth="0x20" ltx:memberofperipheral="PWMC0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="OSCUPH0" edc:desc="Output Selection Clear for PWMH output of the channel 0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OSCUPH1" edc:desc="Output Selection Clear for PWMH output of the channel 1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OSCUPH2" edc:desc="Output Selection Clear for PWMH output of the channel 2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OSCUPH3" edc:desc="Output Selection Clear for PWMH output of the channel 3" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0xC"/>
            <edc:SFRFieldDef edc:cname="OSCUPL0" edc:desc="Output Selection Clear for PWML output of the channel 0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OSCUPL1" edc:desc="Output Selection Clear for PWML output of the channel 1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OSCUPL2" edc:desc="Output Selection Clear for PWML output of the channel 2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OSCUPL3" edc:desc="Output Selection Clear for PWML output of the channel 3" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4002005C" edc:access="--------nnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="PWMC0_FMR" edc:nzwidth="0x20" ltx:memberofperipheral="PWMC0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="FPOL" edc:desc="Fault Polarity" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="FMOD" edc:desc="Fault Activation Mode" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="FFIL" edc:desc="Fault Filtering" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40020060" edc:access="----------------rrrrrrrrrrrrrrrr" edc:cname="PWMC0_FSR" edc:nzwidth="0x20" ltx:memberofperipheral="PWMC0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="FIV" edc:desc="Fault Input Value" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="FS" edc:desc="Fault Status" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
