zeha/xc32/pic32c-source/XC32-arm-gcc/gcc/gcc/testsuite/gcc.target/pic32c/xc32-shell/test-dfp-32CZ_CA70/edc/PIC32CZ2038CA70144.PIC
      <edc:SFRDef edc:_addr="0x4004C008" edc:access="------nnnnnnnnnn------nnnnnnnnnn" edc:cname="ISI_PSIZE" edc:nzwidth="0x20" ltx:memberofperipheral="ISI">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="PREV_VSIZE" edc:desc="Vertical Size for the Preview Path" edc:nzwidth="0xA"/>
            <edc:AdjustPoint edc:offset="0x6"/>
            <edc:SFRFieldDef edc:cname="PREV_HSIZE" edc:desc="Horizontal Size for the Preview Path" edc:nzwidth="0xA"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4004C00C" edc:access="------------------------nnnnnnnn" edc:cname="ISI_PDECF" edc:nzwidth="0x20" ltx:memberofperipheral="ISI">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="DEC_FACTOR" edc:desc="Decimation Factor" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4004C010" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="ISI_Y2R_SET0" edc:nzwidth="0x20" ltx:memberofperipheral="ISI">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="C0" edc:desc="Color Space Conversion Matrix Coefficient C0" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="C1" edc:desc="Color Space Conversion Matrix Coefficient C1" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="C2" edc:desc="Color Space Conversion Matrix Coefficient C2" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="C3" edc:desc="Color Space Conversion Matrix Coefficient C3" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4004C014" edc:access="-----------------nnn---nnnnnnnnn" edc:cname="ISI_Y2R_SET1" edc:nzwidth="0x20" ltx:memberofperipheral="ISI">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="C4" edc:desc="Color Space Conversion Matrix Coefficient C4" edc:nzwidth="0x9"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="Yoff" edc:desc="Color Space Conversion Luminance Default Offset" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="Croff" edc:desc="Color Space Conversion Red Chrominance Default Offset" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="Cboff" edc:desc="Color Space Conversion Blue Chrominance Default Offset" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4004C018" edc:access="-------n-nnnnnnn-nnnnnnn-nnnnnnn" edc:cname="ISI_R2Y_SET0" edc:nzwidth="0x20" ltx:memberofperipheral="ISI">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="C0" edc:desc="Color Space Conversion Matrix Coefficient C0" edc:nzwidth="0x7"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="C1" edc:desc="Color Space Conversion Matrix Coefficient C1" edc:nzwidth="0x7"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="C2" edc:desc="Color Space Conversion Matrix Coefficient C2" edc:nzwidth="0x7"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="Roff" edc:desc="Color Space Conversion Red Component Offset" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4004C01C" edc:access="-------n-nnnnnnn-nnnnnnn-nnnnnnn" edc:cname="ISI_R2Y_SET1" edc:nzwidth="0x20" ltx:memberofperipheral="ISI">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="C3" edc:desc="Color Space Conversion Matrix Coefficient C3" edc:nzwidth="0x7"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="C4" edc:desc="Color Space Conversion Matrix Coefficient C4" edc:nzwidth="0x7"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="C5" edc:desc="Color Space Conversion Matrix Coefficient C5" edc:nzwidth="0x7"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="Goff" edc:desc="Color Space Conversion Green Component Offset" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4004C020" edc:access="-------n-nnnnnnn-nnnnnnn-nnnnnnn" edc:cname="ISI_R2Y_SET2" edc:nzwidth="0x20" ltx:memberofperipheral="ISI">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="C6" edc:desc="Color Space Conversion Matrix Coefficient C6" edc:nzwidth="0x7"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="C7" edc:desc="Color Space Conversion Matrix Coefficient C7" edc:nzwidth="0x7"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="C8" edc:desc="Color Space Conversion Matrix Coefficient C8" edc:nzwidth="0x7"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="Boff" edc:desc="Color Space Conversion Blue Component Offset" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4004C024" edc:access="-----------------------w-----www" edc:cname="ISI_CR" edc:nzwidth="0x20" ltx:memberofperipheral="ISI">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="ISI_EN" edc:desc="ISI Module Enable Request" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ISI_DIS" edc:desc="ISI Module Disable Request" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ISI_SRST" edc:desc="ISI Software Reset Request" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x5"/>
            <edc:SFRFieldDef edc:cname="ISI_CDC" edc:desc="ISI Codec Request" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
