zeha/xc32/pic32c-source/XC32-arm-gcc/gcc/gcc/testsuite/gcc.target/pic32c/xc32-shell/test-dfp-32CZ_CA70/edc/PIC32CZ2038CA70144.PIC
      <edc:SFRDef edc:_addr="0x4004C028" edc:access="----rrrr----r-rr-----r-r-----rrr" edc:cname="ISI_SR" edc:nzwidth="0x20" ltx:memberofperipheral="ISI">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="ENABLE" edc:desc="Module Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DIS_DONE" edc:desc="Module Disable Request has Terminated (cleared on read)" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SRST" edc:desc="Module Software Reset Request has Terminated (cleared on read)" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x5"/>
            <edc:SFRFieldDef edc:cname="CDC_PND" edc:desc="Pending Codec Request" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="VSYNC" edc:desc="Vertical Synchronization (cleared on read)" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x5"/>
            <edc:SFRFieldDef edc:cname="PXFR_DONE" edc:desc="Preview DMA Transfer has Terminated (cleared on read)" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CXFR_DONE" edc:desc="Codec DMA Transfer has Terminated (cleared on read)" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="SIP" edc:desc="Synchronization in Progress" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="P_OVR" edc:desc="Preview Datapath Overflow (cleared on read)" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="C_OVR" edc:desc="Codec Datapath Overflow (cleared on read)" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CRC_ERR" edc:desc="CRC Synchronization Error (cleared on read)" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FR_OVR" edc:desc="Frame Rate Overrun (cleared on read)" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4004C02C" edc:access="----wwww------ww-----w-------ww-" edc:cname="ISI_IER" edc:nzwidth="0x20" ltx:memberofperipheral="ISI">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="DIS_DONE" edc:desc="Disable Done Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SRST" edc:desc="Software Reset Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="VSYNC" edc:desc="Vertical Synchronization Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x5"/>
            <edc:SFRFieldDef edc:cname="PXFR_DONE" edc:desc="Preview DMA Transfer Done Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CXFR_DONE" edc:desc="Codec DMA Transfer Done Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x6"/>
            <edc:SFRFieldDef edc:cname="P_OVR" edc:desc="Preview Datapath Overflow Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="C_OVR" edc:desc="Codec Datapath Overflow Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CRC_ERR" edc:desc="Embedded Synchronization CRC Error Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FR_OVR" edc:desc="Frame Rate Overflow Interrupt Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4004C030" edc:access="----wwww------ww-----w-------ww-" edc:cname="ISI_IDR" edc:nzwidth="0x20" ltx:memberofperipheral="ISI">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="DIS_DONE" edc:desc="Disable Done Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SRST" edc:desc="Software Reset Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="VSYNC" edc:desc="Vertical Synchronization Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x5"/>
            <edc:SFRFieldDef edc:cname="PXFR_DONE" edc:desc="Preview DMA Transfer Done Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CXFR_DONE" edc:desc="Codec DMA Transfer Done Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x6"/>
            <edc:SFRFieldDef edc:cname="P_OVR" edc:desc="Preview Datapath Overflow Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="C_OVR" edc:desc="Codec Datapath Overflow Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CRC_ERR" edc:desc="Embedded Synchronization CRC Error Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FR_OVR" edc:desc="Frame Rate Overflow Interrupt Disable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4004C034" edc:access="----rrrr------rr-----r-------rr-" edc:cname="ISI_IMR" edc:nzwidth="0x20" ltx:memberofperipheral="ISI">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="DIS_DONE" edc:desc="Module Disable Operation Completed" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SRST" edc:desc="Software Reset Completed" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="VSYNC" edc:desc="Vertical Synchronization" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x5"/>
            <edc:SFRFieldDef edc:cname="PXFR_DONE" edc:desc="Preview DMA Transfer Completed" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CXFR_DONE" edc:desc="Codec DMA Transfer Completed" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x6"/>
            <edc:SFRFieldDef edc:cname="P_OVR" edc:desc="Preview FIFO Overflow" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="C_OVR" edc:desc="Codec FIFO Overflow" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CRC_ERR" edc:desc="CRC Synchronization Error" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FR_OVR" edc:desc="Frame Rate Overrun" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
