zeha/xc32/pic32c-source/XC32-arm-gcc/gcc/gcc/testsuite/gcc.target/pic32c/xc32-shell/test-dfp-32CZ_CA70/edc/PIC32CZ2038CA70144.PIC
      <edc:SFRDef edc:_addr="0x40078040" edc:access="--------wwwwwwwwwwwwwwwwwwwwwwww" edc:cname="XDMAC_GSWF" edc:nzwidth="0x20" ltx:memberofperipheral="XDMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="SWF0" edc:desc="XDMAC Channel 0 Software Flush Request Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SWF1" edc:desc="XDMAC Channel 1 Software Flush Request Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SWF2" edc:desc="XDMAC Channel 2 Software Flush Request Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SWF3" edc:desc="XDMAC Channel 3 Software Flush Request Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SWF4" edc:desc="XDMAC Channel 4 Software Flush Request Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SWF5" edc:desc="XDMAC Channel 5 Software Flush Request Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SWF6" edc:desc="XDMAC Channel 6 Software Flush Request Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SWF7" edc:desc="XDMAC Channel 7 Software Flush Request Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SWF8" edc:desc="XDMAC Channel 8 Software Flush Request Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SWF9" edc:desc="XDMAC Channel 9 Software Flush Request Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SWF10" edc:desc="XDMAC Channel 10 Software Flush Request Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SWF11" edc:desc="XDMAC Channel 11 Software Flush Request Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SWF12" edc:desc="XDMAC Channel 12 Software Flush Request Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SWF13" edc:desc="XDMAC Channel 13 Software Flush Request Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SWF14" edc:desc="XDMAC Channel 14 Software Flush Request Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SWF15" edc:desc="XDMAC Channel 15 Software Flush Request Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SWF16" edc:desc="XDMAC Channel 16 Software Flush Request Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SWF17" edc:desc="XDMAC Channel 17 Software Flush Request Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SWF18" edc:desc="XDMAC Channel 18 Software Flush Request Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SWF19" edc:desc="XDMAC Channel 19 Software Flush Request Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SWF20" edc:desc="XDMAC Channel 20 Software Flush Request Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SWF21" edc:desc="XDMAC Channel 21 Software Flush Request Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SWF22" edc:desc="XDMAC Channel 22 Software Flush Request Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SWF23" edc:desc="XDMAC Channel 23 Software Flush Request Bit" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x40078044" edc:offset="0x3FBC"/>
      <edc:SFRDef edc:_addr="0x4007C000" edc:access="-------w----------------w-----ww" edc:cname="QSPI_CR" edc:nzwidth="0x20" ltx:memberofperipheral="QSPI">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="QSPIEN" edc:desc="QSPI Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="QSPIDIS" edc:desc="QSPI Disable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x5"/>
            <edc:SFRFieldDef edc:cname="SWRST" edc:desc="QSPI Software Reset" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x10"/>
            <edc:SFRFieldDef edc:cname="LASTXFER" edc:desc="Last Transfer" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4007C004" edc:access="nnnnnnnnnnnnnnnn----nnnn--nn-nnn" edc:cname="QSPI_MR" edc:nzwidth="0x20" ltx:memberofperipheral="QSPI">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="SMM" edc:desc="Serial Memory Mode" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="SPI" edc:desc="The QSPI is in SPI mode." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="MEMORY" edc:desc="The QSPI is in Serial Memory mode." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="LLB" edc:desc="Local Loopback Enable" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="DISABLED" edc:desc="Local loopback path disabled." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="ENABLED" edc:desc="Local loopback path enabled." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="WDRBT" edc:desc="Wait Data Read Before Transfer" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="DISABLED" edc:desc="No effect. In SPI mode, a transfer can be initiated whatever the state of the QSPI_RDR is." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="ENABLED" edc:desc="In SPI mode, a transfer can start only if the QSPI_RDR is empty, i.e., does not contain any unread data. This mode prevents overrun error in reception." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="CSMODE" edc:desc="Chip Select Mode" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="NOT_RELOADED" edc:desc="The chip select is deasserted if QSPI_TDR.TD has not been reloaded before the end of the current transfer." edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="LASTXFER" edc:desc="The chip select is deasserted when the bit LASTXFER is written at 1 and the character written in QSPI_TDR.TD has been transferred." edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="SYSTEMATICALLY" edc:desc="The chip select is deasserted systematically after each transfer." edc:when="(field &amp; 0x3) == 0x2"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="NBBITS" edc:desc="Number Of Bits Per Transfer" edc:nzwidth="0x4">
              <edc:SFRFieldSemantic edc:cname="_8_BIT" edc:desc="8 bits for transfer" edc:when="(field &amp; 0xF) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="_16_BIT" edc:desc="16 bits for transfer" edc:when="(field &amp; 0xF) == 0x8"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="DLYBCT" edc:desc="Delay Between Consecutive Transfers" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="DLYCS" edc:desc="Minimum Inactive QCS Delay" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4007C008" edc:access="----------------rrrrrrrrrrrrrrrr" edc:cname="QSPI_RDR" edc:nzwidth="0x20" ltx:memberofperipheral="QSPI">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RD" edc:desc="Receive Data" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4007C00C" edc:access="----------------wwwwwwwwwwwwwwww" edc:cname="QSPI_TDR" edc:nzwidth="0x20" ltx:memberofperipheral="QSPI">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="TD" edc:desc="Transmit Data" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4007C010" edc:access="-------r-------------rrr----rrrr" edc:cname="QSPI_SR" edc:nzwidth="0x20" ltx:memberofperipheral="QSPI">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RDRF" edc:desc="Receive Data Register Full (cleared by reading SPI_RDR)" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TDRE" edc:desc="Transmit Data Register Empty (cleared by writing SPI_TDR)" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXEMPTY" edc:desc="Transmission Registers Empty (cleared by writing SPI_TDR)" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OVRES" edc:desc="Overrun Error Status (cleared on read)" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="CSR" edc:desc="Chip Select Rise (cleared on read)" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CSS" edc:desc="Chip Select Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="INSTRE" edc:desc="Instruction End Status (cleared on read)" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0xD"/>
            <edc:SFRFieldDef edc:cname="QSPIENS" edc:desc="QSPI Enable Status" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
