zeha/xc32/pic32c-source/XC32-arm-gcc/gcc/gcc/testsuite/gcc.target/pic32c/xc32-shell/test-dfp-32CZ_CA70/edc/PIC32CZ2038CA70144.PIC
      <edc:AdjustPoint edc:_addr="0x4007C03C" edc:offset="0x4"/>
      <edc:SFRDef edc:_addr="0x4007C040" edc:access="------------------------------nn" edc:cname="QSPI_SMR" edc:nzwidth="0x20" ltx:memberofperipheral="QSPI">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="SCREN" edc:desc="Scrambling/Unscrambling Enable" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="DISABLED" edc:desc="The scrambling/unscrambling is disabled." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="ENABLED" edc:desc="The scrambling/unscrambling is enabled." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="RVDIS" edc:desc="Scrambling/Unscrambling Random Value Disable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4007C044" edc:access="wwwwwwwwwwwwwwwwwwwwwwwwwwwwwwww" edc:cname="QSPI_SKR" edc:nzwidth="0x20" ltx:memberofperipheral="QSPI">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="USRK" edc:desc="User Scrambling Key" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x4007C048" edc:offset="0x9C"/>
      <edc:SFRDef edc:_addr="0x4007C0E4" edc:access="nnnnnnnnnnnnnnnnnnnnnnnn-------n" edc:cname="QSPI_WPMR" edc:nzwidth="0x20" ltx:memberofperipheral="QSPI">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="WPEN" edc:desc="Write Protection Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="WPKEY" edc:desc="Write Protection Key" edc:nzwidth="0x18">
              <edc:SFRFieldSemantic edc:cname="PASSWD" edc:desc="Writing any other value in this field aborts the write operation of the WPEN bit. Always reads as 0." edc:when="(field &amp; 0xFFFFFF) == 0x515350"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4007C0E8" edc:access="----------------rrrrrrrr-------r" edc:cname="QSPI_WPSR" edc:nzwidth="0x20" ltx:memberofperipheral="QSPI">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="WPVS" edc:desc="Write Protection Violation Status" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="WPVSRC" edc:desc="Write Protection Violation Source" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x4007C0EC" edc:offset="0x3F94"/>
      <edc:SFRDef edc:_addr="0x40080080" edc:access="--------------------nnnn-------n" edc:cname="SMC_OCMS" edc:nzwidth="0x20" ltx:memberofperipheral="SMC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="SMSE" edc:desc="Static Memory Controller Scrambling Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="CS0SE" edc:desc="Chip Select (x = 0 to 3) Scrambling Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CS1SE" edc:desc="Chip Select (x = 0 to 3) Scrambling Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CS2SE" edc:desc="Chip Select (x = 0 to 3) Scrambling Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CS3SE" edc:desc="Chip Select (x = 0 to 3) Scrambling Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40080084" edc:access="wwwwwwwwwwwwwwwwwwwwwwwwwwwwwwww" edc:cname="SMC_KEY1" edc:nzwidth="0x20" ltx:memberofperipheral="SMC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="KEY1" edc:desc="Off-Chip Memory Scrambling (OCMS) Key Part 1" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40080088" edc:access="wwwwwwwwwwwwwwwwwwwwwwwwwwwwwwww" edc:cname="SMC_KEY2" edc:nzwidth="0x20" ltx:memberofperipheral="SMC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="KEY2" edc:desc="Off-Chip Memory Scrambling (OCMS) Key Part 2" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x4008008C" edc:offset="0x58"/>
      <edc:SFRDef edc:_addr="0x400800E4" edc:access="nnnnnnnnnnnnnnnnnnnnnnnn-------n" edc:cname="SMC_WPMR" edc:nzwidth="0x20" ltx:memberofperipheral="SMC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="WPEN" edc:desc="Write Protect Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="WPKEY" edc:desc="Write Protection Key" edc:nzwidth="0x18">
              <edc:SFRFieldSemantic edc:cname="PASSWD" edc:desc="Writing any other value in this field aborts the write operation of the WPEN bit. Always reads as 0." edc:when="(field &amp; 0xFFFFFF) == 0x534D43"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400800E8" edc:access="--------rrrrrrrrrrrrrrrr-------r" edc:cname="SMC_WPSR" edc:nzwidth="0x20" ltx:memberofperipheral="SMC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="WPVS" edc:desc="Write Protection Violation Status" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="WPVSRC" edc:desc="Write Protection Violation Source" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
