zeha/xc32/pic32c-source/XC32-arm-gcc/gcc/gcc/testsuite/gcc.target/pic32c/xc32-shell/test-dfp-32CZ_CA70/edc/PIC32CZ2038CA70144.PIC
      <edc:AdjustPoint edc:_addr="0x400E16DC" edc:offset="0x4"/>
      <edc:SFRDef edc:_addr="0x400E16E0" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="PORTE_LOCKSR" edc:nzwidth="0x20" ltx:memberofperipheral="PORTE">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="P0" edc:desc="Lock Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P1" edc:desc="Lock Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P2" edc:desc="Lock Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P3" edc:desc="Lock Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P4" edc:desc="Lock Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P5" edc:desc="Lock Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P6" edc:desc="Lock Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P7" edc:desc="Lock Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P8" edc:desc="Lock Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P9" edc:desc="Lock Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P10" edc:desc="Lock Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P11" edc:desc="Lock Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P12" edc:desc="Lock Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P13" edc:desc="Lock Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P14" edc:desc="Lock Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P15" edc:desc="Lock Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P16" edc:desc="Lock Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P17" edc:desc="Lock Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P18" edc:desc="Lock Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P19" edc:desc="Lock Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P20" edc:desc="Lock Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P21" edc:desc="Lock Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P22" edc:desc="Lock Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P23" edc:desc="Lock Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P24" edc:desc="Lock Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P25" edc:desc="Lock Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P26" edc:desc="Lock Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P27" edc:desc="Lock Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P28" edc:desc="Lock Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P29" edc:desc="Lock Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P30" edc:desc="Lock Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P31" edc:desc="Lock Status" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400E16E4" edc:access="nnnnnnnnnnnnnnnnnnnnnnnn-------n" edc:cname="PORTE_WPMR" edc:nzwidth="0x20" ltx:memberofperipheral="PORTE">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="WPEN" edc:desc="Write Protection Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="WPKEY" edc:desc="Write Protection Key" edc:nzwidth="0x18">
              <edc:SFRFieldSemantic edc:cname="PASSWD" edc:desc="Writing any other value in this field aborts the write operation of the WPEN bit.Always reads as 0." edc:when="(field &amp; 0xFFFFFF) == 0x50494F"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400E16E8" edc:access="--------rrrrrrrrrrrrrrrr-------r" edc:cname="PORTE_WPSR" edc:nzwidth="0x20" ltx:memberofperipheral="PORTE">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="WPVS" edc:desc="Write Protection Violation Status" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="WPVSRC" edc:desc="Write Protection Violation Source" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x400E16EC" edc:offset="0x14"/>
      <edc:SFRDef edc:_addr="0x400E1700" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="PORTE_SCHMITT" edc:nzwidth="0x20" ltx:memberofperipheral="PORTE">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="SCHMITT0" edc:desc="Schmitt Trigger Control" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SCHMITT1" edc:desc="Schmitt Trigger Control" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SCHMITT2" edc:desc="Schmitt Trigger Control" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SCHMITT3" edc:desc="Schmitt Trigger Control" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SCHMITT4" edc:desc="Schmitt Trigger Control" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SCHMITT5" edc:desc="Schmitt Trigger Control" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SCHMITT6" edc:desc="Schmitt Trigger Control" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SCHMITT7" edc:desc="Schmitt Trigger Control" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SCHMITT8" edc:desc="Schmitt Trigger Control" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SCHMITT9" edc:desc="Schmitt Trigger Control" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SCHMITT10" edc:desc="Schmitt Trigger Control" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SCHMITT11" edc:desc="Schmitt Trigger Control" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SCHMITT12" edc:desc="Schmitt Trigger Control" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SCHMITT13" edc:desc="Schmitt Trigger Control" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SCHMITT14" edc:desc="Schmitt Trigger Control" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SCHMITT15" edc:desc="Schmitt Trigger Control" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SCHMITT16" edc:desc="Schmitt Trigger Control" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SCHMITT17" edc:desc="Schmitt Trigger Control" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SCHMITT18" edc:desc="Schmitt Trigger Control" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SCHMITT19" edc:desc="Schmitt Trigger Control" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SCHMITT20" edc:desc="Schmitt Trigger Control" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SCHMITT21" edc:desc="Schmitt Trigger Control" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SCHMITT22" edc:desc="Schmitt Trigger Control" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SCHMITT23" edc:desc="Schmitt Trigger Control" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SCHMITT24" edc:desc="Schmitt Trigger Control" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SCHMITT25" edc:desc="Schmitt Trigger Control" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SCHMITT26" edc:desc="Schmitt Trigger Control" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SCHMITT27" edc:desc="Schmitt Trigger Control" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SCHMITT28" edc:desc="Schmitt Trigger Control" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SCHMITT29" edc:desc="Schmitt Trigger Control" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SCHMITT30" edc:desc="Schmitt Trigger Control" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SCHMITT31" edc:desc="Schmitt Trigger Control" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x400E1704" edc:offset="0x14"/>
      <edc:SFRDef edc:_addr="0x400E1718" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="PORTE_DRIVER" edc:nzwidth="0x20" ltx:memberofperipheral="PORTE">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="LINE0" edc:desc="Drive of PORT Line 0" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="LOW_DRIVE" edc:desc="Lowest drive" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="HIGH_DRIVE" edc:desc="Highest drive" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="LINE1" edc:desc="Drive of PORT Line 1" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="LOW_DRIVE" edc:desc="Lowest drive" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="HIGH_DRIVE" edc:desc="Highest drive" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="LINE2" edc:desc="Drive of PORT Line 2" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="LOW_DRIVE" edc:desc="Lowest drive" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="HIGH_DRIVE" edc:desc="Highest drive" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="LINE3" edc:desc="Drive of PORT Line 3" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="LOW_DRIVE" edc:desc="Lowest drive" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="HIGH_DRIVE" edc:desc="Highest drive" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="LINE4" edc:desc="Drive of PORT Line 4" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="LOW_DRIVE" edc:desc="Lowest drive" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="HIGH_DRIVE" edc:desc="Highest drive" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="LINE5" edc:desc="Drive of PORT Line 5" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="LOW_DRIVE" edc:desc="Lowest drive" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="HIGH_DRIVE" edc:desc="Highest drive" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="LINE6" edc:desc="Drive of PORT Line 6" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="LOW_DRIVE" edc:desc="Lowest drive" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="HIGH_DRIVE" edc:desc="Highest drive" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="LINE7" edc:desc="Drive of PORT Line 7" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="LOW_DRIVE" edc:desc="Lowest drive" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="HIGH_DRIVE" edc:desc="Highest drive" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="LINE8" edc:desc="Drive of PORT Line 8" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="LOW_DRIVE" edc:desc="Lowest drive" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="HIGH_DRIVE" edc:desc="Highest drive" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="LINE9" edc:desc="Drive of PORT Line 9" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="LOW_DRIVE" edc:desc="Lowest drive" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="HIGH_DRIVE" edc:desc="Highest drive" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="LINE10" edc:desc="Drive of PORT Line 10" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="LOW_DRIVE" edc:desc="Lowest drive" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="HIGH_DRIVE" edc:desc="Highest drive" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="LINE11" edc:desc="Drive of PORT Line 11" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="LOW_DRIVE" edc:desc="Lowest drive" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="HIGH_DRIVE" edc:desc="Highest drive" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="LINE12" edc:desc="Drive of PORT Line 12" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="LOW_DRIVE" edc:desc="Lowest drive" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="HIGH_DRIVE" edc:desc="Highest drive" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="LINE13" edc:desc="Drive of PORT Line 13" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="LOW_DRIVE" edc:desc="Lowest drive" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="HIGH_DRIVE" edc:desc="Highest drive" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="LINE14" edc:desc="Drive of PORT Line 14" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="LOW_DRIVE" edc:desc="Lowest drive" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="HIGH_DRIVE" edc:desc="Highest drive" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="LINE15" edc:desc="Drive of PORT Line 15" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="LOW_DRIVE" edc:desc="Lowest drive" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="HIGH_DRIVE" edc:desc="Highest drive" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="LINE16" edc:desc="Drive of PORT Line 16" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="LOW_DRIVE" edc:desc="Lowest drive" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="HIGH_DRIVE" edc:desc="Highest drive" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="LINE17" edc:desc="Drive of PORT Line 17" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="LOW_DRIVE" edc:desc="Lowest drive" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="HIGH_DRIVE" edc:desc="Highest drive" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="LINE18" edc:desc="Drive of PORT Line 18" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="LOW_DRIVE" edc:desc="Lowest drive" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="HIGH_DRIVE" edc:desc="Highest drive" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="LINE19" edc:desc="Drive of PORT Line 19" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="LOW_DRIVE" edc:desc="Lowest drive" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="HIGH_DRIVE" edc:desc="Highest drive" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="LINE20" edc:desc="Drive of PORT Line 20" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="LOW_DRIVE" edc:desc="Lowest drive" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="HIGH_DRIVE" edc:desc="Highest drive" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="LINE21" edc:desc="Drive of PORT Line 21" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="LOW_DRIVE" edc:desc="Lowest drive" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="HIGH_DRIVE" edc:desc="Highest drive" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="LINE22" edc:desc="Drive of PORT Line 22" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="LOW_DRIVE" edc:desc="Lowest drive" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="HIGH_DRIVE" edc:desc="Highest drive" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="LINE23" edc:desc="Drive of PORT Line 23" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="LOW_DRIVE" edc:desc="Lowest drive" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="HIGH_DRIVE" edc:desc="Highest drive" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="LINE24" edc:desc="Drive of PORT Line 24" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="LOW_DRIVE" edc:desc="Lowest drive" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="HIGH_DRIVE" edc:desc="Highest drive" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="LINE25" edc:desc="Drive of PORT Line 25" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="LOW_DRIVE" edc:desc="Lowest drive" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="HIGH_DRIVE" edc:desc="Highest drive" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="LINE26" edc:desc="Drive of PORT Line 26" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="LOW_DRIVE" edc:desc="Lowest drive" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="HIGH_DRIVE" edc:desc="Highest drive" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="LINE27" edc:desc="Drive of PORT Line 27" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="LOW_DRIVE" edc:desc="Lowest drive" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="HIGH_DRIVE" edc:desc="Highest drive" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="LINE28" edc:desc="Drive of PORT Line 28" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="LOW_DRIVE" edc:desc="Lowest drive" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="HIGH_DRIVE" edc:desc="Highest drive" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="LINE29" edc:desc="Drive of PORT Line 29" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="LOW_DRIVE" edc:desc="Lowest drive" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="HIGH_DRIVE" edc:desc="Highest drive" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="LINE30" edc:desc="Drive of PORT Line 30" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="LOW_DRIVE" edc:desc="Lowest drive" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="HIGH_DRIVE" edc:desc="Highest drive" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="LINE31" edc:desc="Drive of PORT Line 31" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="LOW_DRIVE" edc:desc="Lowest drive" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="HIGH_DRIVE" edc:desc="Highest drive" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
