zeha/xc32/pic32c-source/XC32-arm-gcc/gcc/gcc/testsuite/gcc.target/pic32c/xc32-shell/test-dfp-32CZ_CA70/edc/PIC32CZ2038CA70144.PIC
    <edc:Pin>
      <edc:VirtualPin edc:name="PC20"/>
      <edc:VirtualPin edc:name="PC20" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="A2" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="SDA0" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="PWMC0_PWML2" edc:ppsfunction="B"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA30"/>
      <edc:VirtualPin edc:name="PA30" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="PWMC0_PWML2" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="PWMC1_PWMEXTRG0" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="MCDA0" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="I2SC0_DO" edc:ppsfunction="D"/>
      <edc:VirtualPin edc:name="WKUP11" edc:ppsfunction="X1"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD15"/>
      <edc:VirtualPin edc:name="PD15" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="GTX2" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="RXD2" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="NWR1" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="NBS1" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="DQM1" edc:ppsfunction="C"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PB4"/>
      <edc:VirtualPin edc:name="PB4" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="TWD1" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="PWMC0_PWMH2" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="MLBCLK" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="TXD1" edc:ppsfunction="D"/>
      <edc:VirtualPin edc:name="TDI" edc:ppsfunction="X1"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PE2"/>
      <edc:VirtualPin edc:name="PE2" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="D10" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="TCLK9" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="I2SC1_DI" edc:ppsfunction="C"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PB13"/>
      <edc:VirtualPin edc:name="PB13" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="PWMC0_PWML2" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="PCK0" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="SCK0" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="DAC0" edc:ppsfunction="X1"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="VDDUTMIC"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="HSDM"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD1"/>
      <edc:VirtualPin edc:name="PD1" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="GTXEN" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="PWMC1_PWMH0" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="SPI1_NPCS2" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="DTR0" edc:ppsfunction="D"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PC24"/>
      <edc:VirtualPin edc:name="PC24" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="A6" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="SDA4" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="TIOB3" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="SPI1_SPCK" edc:ppsfunction="C"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD3"/>
      <edc:VirtualPin edc:name="PD3" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="GTX1" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="PWMC1_PWMH1" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="UTXD4" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="RI0" edc:ppsfunction="D"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD7"/>
      <edc:VirtualPin edc:name="PD7" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="GRXER" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="PWMC1_PWMH3" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="TRACED3" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="RI2" edc:ppsfunction="D"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA6"/>
      <edc:VirtualPin edc:name="PA6" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="PCK0" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="UTXD1" edc:ppsfunction="C"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PC18"/>
      <edc:VirtualPin edc:name="PC18" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="A0" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="NBS0" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="DQM0" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="PWMC0_PWML1" edc:ppsfunction="B"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="JTAGSEL"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PC17"/>
      <edc:VirtualPin edc:name="PC17" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="A22" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="NANDCLE" edc:ppsfunction="A"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="VDDIN"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PE0"/>
      <edc:VirtualPin edc:name="PE0" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="D8" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="TIOA9" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="I2SC1_WS" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="AFEC1_AD11" edc:ppsfunction="X1"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="VDDOUT"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="VBG"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PC25"/>
      <edc:VirtualPin edc:name="PC25" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="A7" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="SDA5" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="TCLK3" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="SPI1_NPCS0" edc:ppsfunction="C"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PC23"/>
      <edc:VirtualPin edc:name="PC23" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="A5" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="SDA3" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="TIOA3" edc:ppsfunction="B"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PC22"/>
      <edc:VirtualPin edc:name="PC22" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="A4" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="SDA2" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="PWMC0_PWML3" edc:ppsfunction="B"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA31"/>
      <edc:VirtualPin edc:name="PA31" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="SPI0_NPCS1" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="PCK2" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="MCDA1" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="PWMC1_PWMH2" edc:ppsfunction="D"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA28"/>
      <edc:VirtualPin edc:name="PA28" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="DSR1" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="TCLK1" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="MCCDA" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="PWMC1_PWMFI2" edc:ppsfunction="D"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PB5"/>
      <edc:VirtualPin edc:name="PB5" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="TWCK1" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="PWMC0_PWML0" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="MLBDAT" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="TD" edc:ppsfunction="D"/>
      <edc:VirtualPin edc:name="TDO" edc:ppsfunction="X1"/>
      <edc:VirtualPin edc:name="TRACESWO" edc:ppsfunction="X1"/>
      <edc:VirtualPin edc:name="WKUP13" edc:ppsfunction="X1"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA0"/>
      <edc:VirtualPin edc:name="PA0" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="PWMC0_PWMH0" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="TIOA0" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="A17" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="BA1" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="I2SC0_MCK" edc:ppsfunction="D"/>
      <edc:VirtualPin edc:name="WKUP0" edc:ppsfunction="X1"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD10"/>
      <edc:VirtualPin edc:name="PD10" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="GCRS" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="PWMC0_PWML0" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="TD" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="MLBSIG" edc:ppsfunction="D"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="ADVREFP"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="ADVREFN"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD31"/>
      <edc:VirtualPin edc:name="PD31" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="QIO3" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="UTXD3" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="PCK2" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="ISI_D11" edc:ppsfunction="D"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD0"/>
      <edc:VirtualPin edc:name="PD0" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="GTXCK" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="PWMC1_PWML0" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="SPI1_NPCS1" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="DCD0" edc:ppsfunction="D"/>
      <edc:VirtualPin edc:name="DAC1" edc:ppsfunction="X1"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="GNDANA"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD4"/>
      <edc:VirtualPin edc:name="PD4" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="GRXDV" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="PWMC1_PWML2" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="TRACED0" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="DCD2" edc:ppsfunction="D"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD5"/>
      <edc:VirtualPin edc:name="PD5" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="GRX0" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="PWMC1_PWMH2" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="TRACED1" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="DTR2" edc:ppsfunction="D"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PC19"/>
      <edc:VirtualPin edc:name="PC19" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="A1" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="PWMC0_PWMH2" edc:ppsfunction="B"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD9"/>
      <edc:VirtualPin edc:name="PD9" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="GMDIO" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="PWMC0_PWMFI2" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="AFEC1_ADTRG" edc:ppsfunction="C"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD29"/>
      <edc:VirtualPin edc:name="PD29" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="SDWE" edc:ppsfunction="C"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PC16"/>
      <edc:VirtualPin edc:name="PC16" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="A21" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="NANDALE" edc:ppsfunction="A"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA1"/>
      <edc:VirtualPin edc:name="PA1" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="PWMC0_PWML0" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="TIOB0" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="A18" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="I2SC0_CK" edc:ppsfunction="D"/>
      <edc:VirtualPin edc:name="WKUP1" edc:ppsfunction="X1"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PC31"/>
      <edc:VirtualPin edc:name="PC31" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="A13" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="SDA11" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="TCLK5" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="AFEC1_AD6" edc:ppsfunction="X1"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PC27"/>
      <edc:VirtualPin edc:name="PC27" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="A9" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="SDA7" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="TIOB4" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="SPI1_MOSI" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="AFEC1_AD8" edc:ppsfunction="X1"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PE3"/>
      <edc:VirtualPin edc:name="PE3" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="D11" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="TIOA10" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="AFEC1_AD10" edc:ppsfunction="X1"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PC0"/>
      <edc:VirtualPin edc:name="PC0" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="D0" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="PWMC0_PWML0" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="AFEC1_AD9" edc:ppsfunction="X1"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="GNDUTMI"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="GNDPLLUSB"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="VDDUTMII"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="VDDCORE"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD8"/>
      <edc:VirtualPin edc:name="PD8" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="GMDC" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="PWMC0_PWMFI1" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="TRACECLK" edc:ppsfunction="D"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PC14"/>
      <edc:VirtualPin edc:name="PC14" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="NCS0" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="TCLK8" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="CANTX1" edc:ppsfunction="C"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD11"/>
      <edc:VirtualPin edc:name="PD11" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="GRX2" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="PWMC0_PWMH0" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="GTSUCOMP" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="ISI_D5" edc:ppsfunction="D"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA2"/>
      <edc:VirtualPin edc:name="PA2" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="PWMC0_PWMH1" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="DATRG" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="WKUP2" edc:ppsfunction="X1"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PC30"/>
      <edc:VirtualPin edc:name="PC30" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="A12" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="TIOB5" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="SPI1_NPCS3" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="AFEC1_AD5" edc:ppsfunction="X1"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PC26"/>
      <edc:VirtualPin edc:name="PC26" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="A8" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="SDA6" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="TIOA4" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="SPI1_MISO" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="AFEC1_AD7" edc:ppsfunction="X1"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PC29"/>
      <edc:VirtualPin edc:name="PC29" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="A11" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="SDA9" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="TIOA5" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="SPI1_NPCS2" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="AFEC1_AD4" edc:ppsfunction="X1"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PC12"/>
      <edc:VirtualPin edc:name="PC12" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="NCS3" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="TIOB8" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="CANRX1" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="AFEC1_AD3" edc:ppsfunction="X1"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="GND"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="GND"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="GNDPLL"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="VDDPLLUSB"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PB7"/>
      <edc:VirtualPin edc:name="PB7" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="TCK" edc:ppsfunction="X1"/>
      <edc:VirtualPin edc:name="SWDCLK" edc:ppsfunction="X1"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PC10"/>
      <edc:VirtualPin edc:name="PC10" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="NANDWE" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="TCLK7" edc:ppsfunction="B"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PC11"/>
      <edc:VirtualPin edc:name="PC11" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="NRD" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="TIOA8" edc:ppsfunction="B"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA3"/>
      <edc:VirtualPin edc:name="PA3" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="TWD0" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="LONCOL1" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="PCK2" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="PORTDC0" edc:ppsfunction="X1"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PC15"/>
      <edc:VirtualPin edc:name="PC15" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="NCS1" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="SDCS" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="PWMC0_PWML3" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="AFEC1_AD2" edc:ppsfunction="X1"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PC13"/>
      <edc:VirtualPin edc:name="PC13" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="NWAIT" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="PWMC0_PWMH3" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="SDA10" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="AFEC1_AD1" edc:ppsfunction="X1"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PB1"/>
      <edc:VirtualPin edc:name="PB1" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="PWMC0_PWMH1" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="GTSUCOMP" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="TXD0" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="TK" edc:ppsfunction="D"/>
      <edc:VirtualPin edc:name="AFEC1_AD0" edc:ppsfunction="X1"/>
      <edc:VirtualPin edc:name="RTCOUT1" edc:ppsfunction="X1"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="GND"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="GND"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="GND"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="GND"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="VDDIO"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD13"/>
      <edc:VirtualPin edc:name="PD13" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="GCOL" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="SDA10" edc:ppsfunction="C"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD12"/>
      <edc:VirtualPin edc:name="PD12" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="GRX3" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="CANTX1" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="SPI0_NPCS2" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="ISI_D6" edc:ppsfunction="D"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PC9"/>
      <edc:VirtualPin edc:name="PC9" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="NANDOE" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="TIOB7" edc:ppsfunction="B"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PB12"/>
      <edc:VirtualPin edc:name="PB12" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="PWMC0_PWML1" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="GTSUCOMP" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="PCK0" edc:ppsfunction="D"/>
      <edc:VirtualPin edc:name="ERASE" edc:ppsfunction="X1"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA19"/>
      <edc:VirtualPin edc:name="PA19" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="PWMC0_PWML0" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="A15" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="SDA13" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="I2SC1_MCK" edc:ppsfunction="D"/>
      <edc:VirtualPin edc:name="AFEC0_AD8" edc:ppsfunction="X1"/>
      <edc:VirtualPin edc:name="WKUP9" edc:ppsfunction="X1"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA18"/>
      <edc:VirtualPin edc:name="PA18" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="PWMC1_PWMEXTRG1" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="PCK2" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="A14" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="SDA12" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="AFEC0_AD7" edc:ppsfunction="X1"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA20"/>
      <edc:VirtualPin edc:name="PA20" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="PWMC0_PWML1" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="A16" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="BA0" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="I2SC1_CK" edc:ppsfunction="D"/>
      <edc:VirtualPin edc:name="AFEC0_AD9" edc:ppsfunction="X1"/>
      <edc:VirtualPin edc:name="WKUP10" edc:ppsfunction="X1"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PB0"/>
      <edc:VirtualPin edc:name="PB0" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="PWMC0_PWMH0" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="RXD0" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="TF" edc:ppsfunction="D"/>
      <edc:VirtualPin edc:name="AFEC0_AD10" edc:ppsfunction="X1"/>
      <edc:VirtualPin edc:name="RTCOUT0" edc:ppsfunction="X1"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="VDDCORE"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="VDDIO"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="VDDIO"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="VDDCORE"/>
    </edc:Pin>
